"""Вычислить число c заданной точностью d
Пример:
- при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$"""

pi = 3.1415926535
d = float(input('Введите d = '))
count = 0
while d % 1 != 0:
    d *= 10
    count += 1

print(round(pi, count))
